Repository: xcv58/MacTools
Catalog: Plugins/AutoHideDock/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# action.hide.title
source: 隐藏程序坞
ar: إخفاء Dock
de: Dock ausblenden
en: Hide Dock
es: Ocultar el Dock
fr: Masquer le Dock
ja: Dockを隠す
ko: Dock 숨기기
pt: Ocultar Dock
ru: Скрыть Dock
tr: Dock'ı Gizle
zh_hant: 隱藏程式塢

# action.show.title
source: 显示程序坞
ar: إظهار Dock
de: Dock einblenden
en: Show Dock
es: Mostrar el Dock
fr: Afficher le Dock
ja: Dockを表示
ko: Dock 보기
pt: Mostrar Dock
ru: Показать Dock
tr: Dock'ı Göster
zh_hant: 顯示程式塢

# metadata.title
source: 自动隐藏程序坞
ar: إخفاء تلقائي Dock
de: Automatisch ausblenden Dock
en: Auto-Hide Dock
es: Ocultar automáticamente Dock
fr: Masquer automatiquement Dock
ja: 自動非表示 Dock
ko: 자동 숨기기 Dock
pt: Ocultar automaticamente Dock
ru: Автоматическое скрытие Dock
tr: Dock'ı Otomatik Gizle
zh_hant: 自動隱藏Dock

# metadata.description
source: 自动隐藏程序坞，提供更干净的桌面环境
ar: إخفاء Dock تلقائيًا للحصول على سطح مكتب أكثر نظافة.
de: Automatisches Ausblenden des Dock für einen aufgeräumteren Desktop.
en: Auto-hide the Dock for a cleaner desktop.
es: Oculta automáticamente el Dock para tener un escritorio más limpio.
fr: Masquer automatiquement le Dock pour un bureau plus propre.
ja: デスクトップをすっきりさせるために、Dock を自動的に非表示にします。
ko: 더 깔끔한 데스크탑을 위해 Dock을 자동으로 숨깁니다.
pt: Oculte automaticamente Dock para deixar a área de trabalho mais limpa.
ru: Автоматическое скрытие Dock для более чистого рабочего стола.
tr: Daha temiz bir masaüstü için Dock'ı otomatik gizler.
zh_hant: 自動隱藏Dock，提供更乾淨的桌面環境

# panel.subtitle.enabled
source: 已开启
ar: تشغيل
de: Ein
en: On
es: Activado
fr: Activé
ja: オン
ko: 켜기
pt: Ativado
ru: Включено
tr: Açık
zh_hant: 已開啟

# panel.subtitle.disabled
source: 已关闭
ar: إيقاف
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt: Desligado
ru: Выкл.
tr: Kapalı
zh_hant: 已關閉

# error.toggleFailed
source: 切换 Dock 自动隐藏失败
ar: فشل تبديل Dock الإخفاء التلقائي.
de: Automatisches Ausblenden von Dock konnte nicht umgeschaltet werden.
en: Failed to toggle Dock auto-hide.
es: No se pudo alternar la ocultación automática de Dock.
fr: Échec de l'activation du masquage automatique de Dock.
ja: Dock の自動非表示を切り替えることができませんでした。
ko: Dock 자동 숨기기를 전환하지 못했습니다.
pt: Falha ao ativar a ocultação automática de Dock.
ru: Не удалось включить автоматическое скрытие Dock.
tr: Dock'un otomatik gizlenmesi değiştirilemedi.
zh_hant: 切換 Dock 自動隱藏失敗

# permission.automation.description
source: 切换程序坞自动隐藏时需要控制系统事件。
ar: يتطلب تغيير الإخفاء التلقائي لـ Dock التحكم في أحداث النظام.
de: Zum Ändern des automatischen Ausblendens des Docks muss „System Events“ gesteuert werden.
en: Changing Dock auto-hide requires controlling System Events.
es: Cambiar la ocultación automática del Dock requiere controlar Eventos del Sistema.
fr: Modifier le masquage automatique du Dock nécessite de contrôler Événements système.
ja: Dockの自動的な表示／非表示を切り替えるには、「システムイベント」の制御が必要です。
ko: Dock 자동 가리기를 변경하려면 ‘시스템 이벤트’를 제어해야 합니다.
pt: Alterar a ocultação automática do Dock requer o controle dos Eventos do Sistema.
ru: Для изменения автоскрытия Dock требуется управление приложением «Системные события».
tr: Dock'un otomatik gizlenmesini değiştirmek, System Events'ın denetlenmesini gerektirir.
zh_hant: 切換 Dock 自動隱藏時需要控制「系統事件」。

# permission.automation.footnote
source: macOS 会在首次使用时请求自动化授权。
ar: سيطلب macOS إذن الأتمتة عند الاستخدام للمرة الأولى.
de: macOS fragt bei der ersten Verwendung nach der Automation-Berechtigung.
en: macOS will request Automation access the first time this is used.
es: macOS solicitará acceso de automatización la primera vez que se use.
fr: macOS demandera l’autorisation d’automatisation lors de la première utilisation.
ja: 初回使用時に、macOSがオートメーションの許可を求めます。
ko: 처음 사용할 때 macOS가 자동화 권한을 요청합니다.
pt: O macOS solicitará acesso à Automação na primeira utilização.
ru: При первом использовании macOS запросит доступ к автоматизации.
tr: macOS, bu özellik ilk kez kullanıldığında Otomasyon erişimi isteyecek.
zh_hant: macOS 會在首次使用時要求自動化授權。

# permission.automation.title
source: 自动化
ar: الأتمتة
de: Automation
en: Automation
es: Automatización
fr: Automatisation
ja: オートメーション
ko: 자동화
pt: Automação
ru: Автоматизация
tr: Otomasyon
zh_hant: 自動化

# permission.automation.status
source: 按需确认
ar: تأكيد عند الاستخدام
de: Bestätigung bei Verwendung
en: Confirm on Use
es: Confirmar al usar
fr: Confirmation à l’utilisation
ja: 使用時に確認
ko: 사용 시 확인
pt: Confirmar ao usar
ru: Подтверждение при использовании
tr: Kullanırken Onayla
zh_hant: 按需確認
